Revit 2027 API
ItemFactoryBase.NewFamilyInstance(Reference, Line, FamilySymbol) Method
Inserts a new instance of a family onto a face referenced by the input Reference instance, using a line on that face for its position, and a type/symbol.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstance NewFamilyInstance(
	Reference reference,
	Line position,
	FamilySymbol symbol
)
Public Function NewFamilyInstance (
	reference As Reference,
	position As Line,
	symbol As FamilySymbol
) As FamilyInstance
public:
FamilyInstance^ NewFamilyInstance(
	Reference^ reference,
	Line^ position,
	FamilySymbol^ symbol
)
member NewFamilyInstance :
        reference : Reference *
        position : Line *
        symbol : FamilySymbol -> FamilyInstance
Parameters
reference Reference
A reference to a face.
position Line
A line on the face defining where the symbol is to be placed.
symbol FamilySymbol
A FamilySymbol object that represents the type of the instance that is to be inserted. Note that this symbol must represent a family whose FamilyPlacementType is WorkPlaneBased or CurveBased.
Return Value
FamilyInstance
An instance of the new object if creation was successful, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a non-optional argument was null.
ArgumentException | Thrown when the function cannot get a face from the reference, or, when the family cannot be placed as line-based on an input face reference, because its FamilyPlacementType is not WorkPlaneBased or CurveBased
ArgumentsInconsistentException | Thrown when the family cannot be placed on this line as it does not coincide with the input face.
InvalidOperationException | Thrown when Revit is unable to place the family instance.
ArgumentException | Thrown if The symbol is not active.
Remarks
Use this method to insert one family instance on a face of another element, using a line on the face to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.
The host object must support insertion of instances, otherwise this method will fail. If the instance fails to be created an exception may be thrown.
Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.
Example
public void PlaceStiffenerOnWallFaceRef(Autodesk.Revit.DB.Document doc)
{
    FilteredElementCollector wallCollector = new FilteredElementCollector(doc);
    wallCollector.OfClass(typeof(Wall));
    Wall wall = wallCollector.FirstElement() as Wall;
    // The structural stiffeners family type is compatible with line-based face placement
    FilteredElementCollector fsCollector = new FilteredElementCollector(doc);
    fsCollector.OfClass(typeof(FamilySymbol)).OfCategory(BuiltInCategory.OST_StructuralStiffener);
    FamilySymbol stiffenerSymbol = fsCollector.FirstElement() as FamilySymbol;
    // Get side face of wall
    IList<Reference> sideFaces = HostObjectUtils.GetSideFaces(wall, ShellLayerType.Exterior);
    Reference sideFaceRef = sideFaces[0];
    // Generate line for path
    Face face = wall.GetGeometryObjectFromReference(sideFaceRef) as Face;
    BoundingBoxUV bbox = face.GetBoundingBox();
    UV lowerLeft = bbox.Min;
    UV upperRight = bbox.Max;
    double deltaU = upperRight.U - lowerLeft.U;
    double deltaV = upperRight.V - lowerLeft.V;
    double vOffset = deltaV * 0.60; // 60% up the wall face
    UV firstPoint = lowerLeft + new UV(deltaU * 0.20, vOffset);
    UV lastPoint = lowerLeft + new UV(deltaU * 0.80, vOffset);
    Line line = Line.CreateBound(face.Evaluate(firstPoint), face.Evaluate(lastPoint));
    doc.Create.NewFamilyInstance(sideFaceRef, line, stiffenerSymbol);
}
See Also
Reference
ItemFactoryBase Class
NewFamilyInstance Overload
Autodesk.Revit.Creation Namespace